const rows = [
  // 1ο εξάμηνο
  [1,'Κ03',6,'Γραμμική Άλγεβρα','ΥΜ'],[1,'Κ09',7,'Διακριτά Μαθηματικά','ΥΜ'],[1,'ΓΠ07',2,'Εισαγωγή στην Πληροφορική και στις Τηλεπικοινωνίες','ΓΠ'],[1,'Κ04',7,'Εισαγωγή στον Προγραμματισμό','ΥΜ'],[1,'K02ε',2,'Εργαστήριο Λογικής Σχεδίασης','ΕΡ'],[1,'Κ02',6,'Λογική Σχεδίαση','ΥΜ'],
  // 2ο εξάμηνο
  [2,'Κ01',8,'Ανάλυση Ι','ΥΜ'],[2,'Κ14',7,'Αρχιτεκτονική Υπολογιστών Ι','ΥΜ'],[2,'Κ08',7,'Δομές Δεδομένων και Τεχνικές Προγραμματισμού','ΥΜ'],[2,'Κ20β',6,'Εφαρμοσμένα Μαθηματικά','ΠΜ'],[2,'Κ12',8,'Ηλεκτρομαγνητισμός – Οπτική και Σύγχρονη Φυσική','ΥΜ'],
  // 3ο εξάμηνο
  [3,'Κ06',8,'Ανάλυση ΙΙ','ΥΜ'],[3,'Κ10',8,'Αντικειμενοστραφής Προγραμματισμός','ΥΜ'],[3,'Κ11ε',2,'Εργαστήριο Κυκλωμάτων και Συστημάτων','ΕΡ'],[3,'Κ13',6,'Πιθανότητες και Στατιστική','ΥΜ'],[3,'Κ11',6,'Σήματα και Συστήματα','ΥΜ'],
  // 4ο εξάμηνο
  [4,'Κ17',8,'Αλγόριθμοι και Πολυπλοκότητα','ΥΜ'],[4,'Κ16',6,'Δίκτυα Επικοινωνιών I','ΥΜ'],[4,'Κ16ε',2,'Εργαστήριο Δικτύων Επικοινωνιών Ι','ΕΡ'],[4,'Κ21',7,'Συστήματα Επικοινωνιών','ΥΜ'],[4,'Κ29',7,'Σχεδίαση και Χρήση Βάσεων Δεδομένων','ΥΜ'],
  // 5ο εξάμηνο
  [5,'Κ15',6,'Αριθμητική Ανάλυση','ΕΥΜ'],[5,'ΘΠ01',6,'Αρχές Γλωσσών Προγραμματισμού','ΠΜ'],[5,'Κ30',6,'Αρχιτεκτονική Υπολογιστών ΙΙ','ΕΥΜ'],[5,'ΕΠ13',6,'Ασύρματες Επικοινωνίες και Συστήματα','ΠΜ'],[5,'ΘΠ02',6,'Γραφικά Ι','ΠΜ'],[5,'Κ33',6,'Δίκτυα Επικοινωνιών II','ΕΥΜ'],[5,'ΕΠ05',6,'Κύματα, Κυματοδηγοί, Κεραίες','ΠΜ'],[5,'Κ22',8,'Λειτουργικά Συστήματα','ΥΜ'],[5,'ΘΠ04',6,'Παράλληλα Συστήματα','ΠΜ'],[5,'ΥΣ03',6,'Σχεδίαση Ψηφιακών Συστημάτων - VHDL','ΠΜ'],[5,'ΥΣ02',6,'Τεχνητή Νοημοσύνη I','ΠΜ'],[5,'ΕΠ20',6,'Τηλεπικοινωνιακά Δίκτυα','ΠΜ'],[5,'Κ18',6,'Υλοποίηση Συστημάτων Βάσεων Δεδομένων','ΕΥΜ'],[5,'Κ32',6,'Ψηφιακή Επεξεργασία Σήματος','ΕΥΜ'],
  // 6ο εξάμηνο
  [6,'ΘΠ16β',6,'Αλγόριθμοι-Θεμελιώσεις Μηχανικής Μάθησης','ΠΜ'],[6,'ΕΠ08',6,'Αναγνώριση Προτύπων–Μηχανική Μάθηση','ΠΜ'],[6,'ΥΣ04',6,'Ανάλυση/Σχεδίαση Συστημάτων Λογισμικού','ΠΜ'],[6,'ΥΣ18',6,'Ασύρματα Δίκτυα Αισθητήρων','ΠΜ'],[6,'Κ34',6,'Διαχείριση Δικτύων','ΕΥΜ'],[6,'ΕΠ22β',4,'Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος – Πολυμέσα και Ασύρματη Δικτύωση','ΠΜ'],[6,'ΕΠ07',6,'Επεξεργασία Στοχαστικών Σημάτων','ΠΜ'],[6,'ΘΠ03',6,'Επιστημονικοί Υπολογισμοί','ΠΜ'],[6,'Κ19ε',6,'Εργαστήριο Ηλεκτρονικής','ΠΜ'],[6,'K19',6,'Ηλεκτρονική','ΕΥΜ'],[6,'Κ35',6,'Θεωρία Πληροφορίας','ΕΥΜ'],[6,'Κ25',6,'Θεωρία Υπολογισμού','ΕΥΜ'],[6,'ΥΣ05',6,'Λογικός Προγραμματισμός','ΠΜ'],[6,'Κ20α',6,'Μαθηματικά Πληροφορικής','ΕΥΜ'],[6,'Κ31',6,'Μεταγλωττιστές','ΕΥΜ'],[6,'Κ24',8,'Προγραμματισμός Συστήματος','ΥΜ'],[6,'ΥΣ19',6,'Τεχνητή Νοημοσύνη ΙΙ (Βαθιά Μηχανική Μάθηση για την Επεξεργασία Φυσικής Γλώσσας)','ΠΜ'],[6,'ΥΣ11',6,'Τεχνικές Εξόρυξης Δεδομένων','ΠΜ'],[6,'ΥΣ14',6,'Τεχνολογίες Εφαρμογών Διαδικτύου','ΠΜ'],
  // 7ο εξάμηνο
  [7,'ΘΠ09',6,'Αλγοριθμική Επιχειρησιακή Έρευνα','ΠΜ'],[7,'ΕΠ23',6,'Ανάλυση Εικόνας και Τεχνητή Όραση','ΠΜ'],[7,'ΕΠ11',6,'Ανάπτυξη Εικονικών Οργάνων για Λήψη και Επεξεργασία Σημάτων','ΠΜ'],[7,'Κ23γ',8,'Ανάπτυξη Λογισμικού για Αλγοριθμικά Προβλήματα','Project'],[7,'Κ23α',8,'Ανάπτυξη Λογισμικού για Πληροφοριακά Συστήματα','Project'],[7,'Κ23β',8,'Ανάπτυξη Λογισμικού για Συστήματα Δικτύων και Τηλεπικοινωνιών','Project'],[7,'ΥΣ10',6,'Διδακτική της Πληροφορικής','ΠΜ'],[7,'ΓΠ03',2,'Δομή και Θεσμοί της Ευρωπαϊκής Ένωσης','ΓΠ'],[7,'ΕΠ22στ',4,'Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος: Βαθιά Μάθηση','ΠΜ'],[7,'ΕΠ22δ',4,'Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος: Ειδικά Θέματα Κβαντικής Πληροφορίας και Υπολογιστικής','ΠΜ'],[7,'ΥΣ16',4,'Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών','ΠΜ'],[7,'ΥΣ16β',4,'Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών – Τεχνολογίες Γνώσεων','ΠΜ'],[7,'ΕΠ22α',6,'Ενισχυτική Μηχανική Μάθηση και Στοχαστικά Παίγνια','ΠΜ'],[7,'ΕΠ10',6,'Επεξεργασία Εικόνας','ΠΜ'],[7,'ΥΣ08',6,'Επικοινωνία Ανθρώπου Μηχανής','ΠΜ'],[7,'ΥΣ17',4,'Ηλεκτρονική Διακυβέρνηση','ΠΜ'],[7,'ΘΠ08',6,'Θεωρία Αριθμών','ΠΜ'],[7,'ΕΠ16',6,'Οπτικές Επικοινωνίες και Οπτικά Δίκτυα','ΠΜ'],[7,'ΥΣ07',6,'Πληροφοριακά Συστήματα','ΠΜ'],[7,'ΘΠ12',6,'Προηγμένα Θέματα Αλγορίθμων','ΠΜ'],[7,'ΘΠ18',6,'Προηγμένοι Επιστημονικοί Υπολογισμοί','ΠΜ'],[7,'ΕΠ18',6,'Συστήματα Κινητών και Προσωπικών Επικοινωνιών','ΠΜ'],[7,'ΕΠ01',6,'Σχεδίαση VLSI Κυκλωμάτων','ΠΜ'],[7,'ΥΣ15',6,'Τεχνολογίες της Πληροφορίας και των Επικοινωνιών (ΤΠΕ) στη Μάθηση','ΠΜ'],[7,'ΘΠ11',6,'Υπολογιστική Γεωμετρία','ΠΜ'],[7,'ΘΠ20',6,'Υπολογιστική Πολυπλοκότητα','ΠΜ'],[7,'ΥΣ22',6,'Ψηφιακή Προσβασιμότητα και Υποστηρικτικές Τεχνολογίες Πληροφορικής','ΠΜ'],
  // 8ο εξάμηνο
  [8,'ΘΠ24',6,'Αλγοριθμική Επίλυση Προβλημάτων','ΠΜ'],[8,'Κ23δ',8,'Ανάπτυξη Υλικού-Λογισμικού για Ενσωματωμένα Συστήματα','Project'],[8,'ΓΠ05',2,'Διοίκηση Έργων και Τεχνικές Παρουσίασης και Συγγραφής Επιστημονικών Εκθέσεων','ΓΠ'],[8,'ΕΠ22γ',4,'Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος: Γραμμές μεταφοράς, κυματοδηγοί και οπτικές ίνες','ΠΜ'],[8,'ΕΠ22ε',4,'Ειδικά Θέματα Επικοινωνιών και Επεξεργασίας Σήματος: Ειδικά Θέματα Κβαντικής Μηχανικής Μάθησης','ΠΜ'],[8,'ΘΠ16δ',6,'Ειδικά Θέματα Θεωρητικής Πληροφορικής: Αλγόριθμοι Δομικής Βιοπληροφορικής','ΠΜ'],[8,'ΥΣ16',4,'Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών','ΠΜ'],[8,'ΥΣ16β',6,'Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών: Αξιόπιστα Συστήματα Λογισμικού','ΠΜ'],[8,'ΥΣ16α',4,'Ειδικά Θέματα Υπολογιστικών Συστημάτων και Εφαρμογών: Υπολογιστικά Συστήματα Μεγάλης Κλίμακας','ΠΜ'],[8,'ΕΠ19',6,'Επεξεργασία Ομιλίας και Φυσικής Γλώσσας','ΠΜ'],[8,'ΘΠ10',6,'Θεωρία Γραφημάτων','ΠΜ'],[8,'ΥΣ20',4,'Ιστορία της Πληροφορικής και των Τηλεπικοινωνιών','ΠΜ'],[8,'ΥΣ12',4,'Καινοτομία και Επιχειρηματικότητα','ΠΜ'],[8,'ΘΠ05',6,'Κρυπτογραφία','ΠΜ'],[8,'ΕΠ24',4,'Μικροοικονομική Ανάλυση','ΠΜ'],[8,'ΕΠ21',4,'Μουσική Πληροφορική','ΠΜ'],[8,'ΘΠ19',6,'Παράλληλοι Αλγόριθμοι','ΠΜ'],[8,'ΥΣ13',6,'Προστασία και Ασφάλεια Υπολογιστικών Συστημάτων','ΠΜ'],[8,'ΘΠ16α',6,'Σημασιολογία Γλωσσών Προγραμματισμού','ΠΜ'],[8,'ΥΣ24',6,'Σχεδίαση & Χρήση Περιβαλλόντων η-Μάθησης','ΠΜ'],[8,'ΥΣ21',6,'Σχολική Τάξη & Μικροδιδασκαλία','ΠΜ'],[8,'ΥΣ09',6,'Τεχνολογία Λογισμικού','ΠΜ'],[8,'ΘΠ23',6,'Υπολογιστική Θεωρία Μηχανικής Μάθησης','ΠΜ'],[8,'ΕΠ12',6,'Φωτονική','ΠΜ'],[8,'ΕΠ04',6,'Ψηφιακές Επικοινωνίες','ΠΜ'],
  // Ελεύθερα μαθήματα ακαδημαϊκού έτους 2025-26
  [3,'13Β008',9.5,'Βιολογία Κυττάρου','ΕΛ'],
  [5,'13Β015',7,'Εξελικτική Βιολογία','ΕΛ'],
  [null,'13Β041',5.5,'Βιοπληροφορική','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'12559',6,'Θεωρία Παιγνίων και Εφαρμογές','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'12541',9,'Μαθηματική Στατιστική','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'12401',9,'Πραγματική Ανάλυση','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'12654',6,'Γραμμικά Μοντέλα','ΕΛ','Εαρινό εξάμηνο'],
  [null,'12439',4.5,'Υπολογιστική Άλγεβρα','ΕΛ','Εαρινό εξάμηνο'],
  [7,'10ΕΚ201',6,'Προχωρημένα Θέματα Ηλεκτρονικής','ΕΛ'],
  [3,'86Υ06',6,'Ιστορία: Αρχαιότητα και Μέσοι Χρόνοι','ΕΛ'],
  [7,'86Ε31',5.5,'Επιστήμη, Τεχνολογία, Περιβάλλον','ΕΛ'],
  [7,'86ΥΙ12',5.5,'Επιστημονική και Τεχνολογική Πολιτική','ΕΛ'],
  [4,'86Υ16',6,'Φιλοσοφία της Επιστήμης','ΕΛ'],
  [6,'86Ε38',5.5,'Γνωσιακή Επιστήμη','ΕΛ'],
  [6,'86Υ21',6,'Επιστήμη, Τεχνολογία, Κοινωνία','ΕΛ'],
  [6,'86ΥΙ06',5.5,'Ιστορία της Τεχνολογίας','ΕΛ'],
  [8,'86ΥΙ13',5.5,'Φύλο, Επιστήμη, Τεχνολογία','ΕΛ'],
  [8,'40ΥΕ2095',4,'Νομική Πληροφορική','ΕΛ'],
  [8,'44Μ309',6,'Δημιουργία Νέας Επιχείρησης','ΕΛ','Ετήσιο μάθημα'],
  [null,'41ECO101',7,'Εισαγωγή στην Οικονομική Ανάλυση','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'41FIN467',7,'Χρηματοοικονομικά Υποδείγματα για Επιχειρηματικές Αποφάσεις','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'61II84',6,'Ιστορία του Μεταπολεμικού Κόσμου Ι','ΕΛ','Εαρινό εξάμηνο'],
  [null,'69Μ090',5,'Εισαγωγή στη Μουσική Τεχνολογία','ΕΛ','Χειμερινό εξάμηνο'],
  [null,'69Μ232',5,'Εισαγωγή στο Μουσικό Προγραμματισμό','ΕΛ','Εαρινό εξάμηνο'],
  [3,'74ΤΕΚ009',6,'Αναλυτικά Προγράμματα','ΕΛ'],
  [1,'74TEK001',6,'Εισαγωγή στην Παιδαγωγική','ΕΛ'],
  [5,'74ΤΕΚ014',6,'Θεωρία και Μεθοδολογία της Διδασκαλίας','ΕΛ'],
  [5,'67ΨΧ32',5,'Ψηφιακές Τεχνολογίες στην Εκπαίδευση','ΕΛ'],
  [8,'74ΤΕΚ621',6,'Ιστορία της Εκπαίδευσης','ΕΛ'],
  [8,'74ΤΕΚ622',6,'Ιστορία της Νεοελληνικής Εκπαίδευσης','ΕΛ'],
  [null,'74TEK003',6,'Παιδαγωγική Ψυχολογία','ΕΛ','Εαρινό εξάμηνο'],
  [null,'74ΤΕΚ228',6,'Το Ψηφιακό Παιχνίδι ως Νέος Γραμματισμός','ΕΛ','Εαρινό εξάμηνο'],
  [6,'82517',5,'Ψηφιακά Παιχνίδια, Εικονικοί Κόσμοι και Μάθηση: Έρευνα και Εφαρμογές','ΕΛ'],
  // Πρακτική άσκηση και πτυχιακή εργασία
  [5,'ΠΡΑΚ1',8,'Πρακτική 1','ΠΡ','5ο ή 7ο εξάμηνο',[5,7]],
  [6,'ΠΡΑΚ2',8,'Πρακτική 2','ΠΡ','6ο ή 8ο εξάμηνο',[6,8]],
  [5,'ΠΤΥΧ1',8,'Πτυχιακή 1','ΠΤ','5ο ή 7ο εξάμηνο',[5,7]],
  [6,'ΠΤΥΧ2',8,'Πτυχιακή 2','ΠΤ','6ο ή 8ο εξάμηνο',[6,8]],
]

export const typeLabels = {
  ΥΜ: 'Υποχρεωτικό',
  ΕΥΜ: 'Κατ’ επιλογή υποχρεωτικό',
  ΠΜ: 'Προαιρετικό',
  ΕΡ: 'Εργαστήριο',
  ΓΠ: 'Γενικής παιδείας',
  Project: 'Project',
  ΕΛ: 'Ελεύθερο μάθημα',
  ΠΡ: 'Πρακτική άσκηση',
  ΠΤ: 'Πτυχιακή εργασία',
}

export const courses = rows.map(([offeredSemester, code, ects, title, type, customSemesterLabel, availableSemesters], index) => ({
  id: `${offeredSemester ?? customSemesterLabel}-${code}-${index}`,
  offeredSemester,
  semesterLabel: customSemesterLabel || `${offeredSemester}ο εξάμηνο`,
  semesterFilters: availableSemesters?.map(String) || [offeredSemester
    ? String(offeredSemester)
    : customSemesterLabel.startsWith('Χειμερινό')
      ? 'winter'
      : customSemesterLabel.startsWith('Εαρινό')
        ? 'spring'
        : 'annual'],
  defaultSemester: offeredSemester || (customSemesterLabel.startsWith('Εαρινό') ? 2 : 1),
  code,
  ects,
  title,
  type,
}))
